# -*- mode:org -*-
#+TITLE: dot files
#+STARTUP: indent
#+OPTIONS: toc:nil
*** profiles.clj
#+BEGIN_SRC clojure :tangle ~/.lein/profiles.clj
{:user {:plugins [[cider/cider-nrepl "0.18.0-SNAPSHOT"]
		  [lein-bin "0.3.4"]
		  [compliment "0.3.2"]]
	:dependencies [[org.clojure/tools.nrepl "0.2.12"]]}
 :jvm-opts ^:replace []                 ;overtone
 }

{:repl {:plugins [[cider/cider-nrepl "0.16.0-SNAPSHOT"]
		  [refactor-nrepl "2.3.1"]]
	:dependencies [[alembic "0.3.2"]
		       [org.clojure/tools.nrepl "0.2.12"]]}
 :jvm-opts ^:replace []                 ;overtone
 }

#+END_SRC

#+RESULTS:
: class clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionCompilerException java.lang.RuntimeException: No such namespace: cider, compiling:(*cider-repl .emacs.d*:1:14646) 
: CompilerException java.lang.RuntimeException: No such namespace: cider, compiling:(*cider-repl .emacs.d*:1:14646) 
